#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

plan
module.redirect_lambda.data.archive_file.lambda: Reading...
module.create_short_url_lambda.data.archive_file.lambda: Reading...
module.redirect_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.create_short_url_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Reading...
aws_api_gateway_rest_api.url_shortener_api: Refreshing state... [id=hc5yzh4uka]
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
aws_dynamodb_table.urls: Refreshing state... [id=urls]
aws_api_gateway_resource.redirect_resource: Refreshing state... [id=9fgzxp]
module.post_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-hc5yzh4uka-nh1ykpwsj5-POST]
data.aws_iam_policy_document.create_short_url_lambda: Reading...
data.aws_iam_policy_document.allow_get_url_lambda: Reading...
data.aws_iam_policy_document.create_short_url_lambda: Read complete after 0s [id=2348542042]
data.aws_iam_policy_document.allow_get_url_lambda: Read complete after 0s [id=2816463254]
module.create_short_url_lambda.data.aws_iam_policy_document.policies: Reading...
module.redirect_lambda.data.aws_iam_policy_document.policies: Reading...
module.create_short_url_lambda.data.aws_iam_policy_document.policies: Read complete after 0s [id=1299851198]
module.redirect_lambda.data.aws_iam_policy_document.policies: Read complete after 0s [id=4168244811]
module.redirect_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=redirect--lambda-lambda-role]
module.create_short_url_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=create-short-url--lambda-lambda-role]
module.redirect_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-hc5yzh4uka-9fgzxp-GET]
module.create_short_url_lambda.aws_lambda_function.lambda: Refreshing state... [id=create-short-url--lambda]
module.redirect_lambda.aws_lambda_function.lambda: Refreshing state... [id=redirect--lambda]
module.redirect_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.redirect_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-hc5yzh4uka-9fgzxp-GET]
module.post_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-hc5yzh4uka-nh1ykpwsj5-POST]
module.post_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_deployment.url_shortener_api_deployment: Refreshing state... [id=x1xmar]
aws_api_gateway_stage.live: Refreshing state... [id=ags-hc5yzh4uka-live]
aws_api_gateway_usage_plan.usage: Refreshing state... [id=3cusni]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.create_short_url_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/create-short-url--lambda-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-24T22:36:57Z" -> (known after apply)
      ~ id                    = "create-short-url--lambda-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "create-short-url--lambda-lambda-role" -> "create-short-url--lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT4523PSIZCQM" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.create_short_url_lambda.aws_lambda_function.lambda must be replaced
+/- resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:692735942459:function:create-short-url--lambda" -> (known after apply)
      ~ code_sha256                    = "slQbp92P5eqcux38WC+G18045G8xtUSaDaIDR4KrZlI=" -> (known after apply)
      ~ filename                       = "create-short-url--lambda_lambda_function_payload.zip" -> "create-short-url-_lambda_function_payload.zip"
      ~ function_name                  = "create-short-url--lambda" -> "create-short-url-" # forces replacement
      ~ id                             = "create-short-url--lambda" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url--lambda/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-24T23:14:17.207+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:692735942459:function:create-short-url--lambda:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url--lambda:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::692735942459:role/create-short-url--lambda-lambda-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 294 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/create-short-url--lambda" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.post_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-hc5yzh4uka-nh1ykpwsj5-POST"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url--lambda/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.post_url_method.aws_lambda_permission.apigw_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_lambda" {
      ~ function_name       = "create-short-url--lambda" -> "create-short-url-" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.redirect_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/redirect--lambda-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-24T22:36:57Z" -> (known after apply)
      ~ id                    = "redirect--lambda-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "redirect--lambda-lambda-role" -> "redirect--lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT45UK544XTU4" -> (known after apply)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.redirect_lambda.aws_lambda_function.lambda must be replaced
+/- resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:692735942459:function:redirect--lambda" -> (known after apply)
      ~ code_sha256                    = "slQbp92P5eqcux38WC+G18045G8xtUSaDaIDR4KrZlI=" -> (known after apply)
      ~ filename                       = "redirect--lambda_lambda_function_payload.zip" -> "redirect-_lambda_function_payload.zip"
      ~ function_name                  = "redirect--lambda" -> "redirect-" # forces replacement
      ~ id                             = "redirect--lambda" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect--lambda/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-24T23:14:23.054+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:692735942459:function:redirect--lambda:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect--lambda:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::692735942459:role/redirect--lambda-lambda-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 294 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/redirect--lambda" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.redirect_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-hc5yzh4uka-9fgzxp-GET"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect--lambda/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.redirect_url_method.aws_lambda_permission.apigw_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_lambda" {
      ~ function_name       = "redirect--lambda" -> "redirect-" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan"

```

</details>
*Pushed by: @EsmerlinJM, Action: `pull_request`*